app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(email: lead[0], first_name: lead[1], last_name: lead[2])
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-10-11 16:53:13.308831"], ["updated_at", "2018-10-11 16:53:13.308831"]]